espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_se_driver_aead.c
#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_se_driver_aead_set_lengths(sli_se_driver_aead_operation_t *operation,
                                            size_t ad_length,
                                            size_t plaintext_length)
{
#if (defined(PSA_WANT_ALG_CCM)) \
  || defined(PSA_WANT_ALG_GCM)

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // To pass current PSA Crypto test suite, tag length encoded in the
  // algorithm needs to be checked at this point.
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      if ((PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) % 2 != 0)
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) < 4
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) > 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      break;
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      if (PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) < 4
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) > 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      break;
#endif
    default:
      return PSA_ERROR_BAD_STATE;
  }

  if (operation->ad_len != 0 || operation->pt_len != 0) {
    return PSA_ERROR_BAD_STATE;
  }

  operation->ctx.preinit.ad_length = ad_length;
  operation->ctx.preinit.pt_length = plaintext_length;
  return PSA_SUCCESS;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
  (void)operation;
  (void)ad_length;
  (void)plaintext_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

#if defined(PSA_WANT_ALG_CCM) \
  || defined(PSA_WANT_ALG_GCM)

static psa_status_t aead_start(sli_se_driver_aead_operation_t *operation,
                               const uint8_t *input,
                               size_t input_length)
{
  // Ephemeral contexts
#if defined(PSA_WANT_ALG_GCM) \
  || defined(PSA_WANT_ALG_CCM)
  sli_se_driver_aead_preinit_t preinit = operation->ctx.preinit;
#endif

  sl_se_command_context_t cmd_ctx = { 0 };

  sl_status_t status = sl_se_init_command_context(&cmd_ctx);
  if (status != SL_STATUS_OK) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

#if defined(PSA_WANT_ALG_CCM)
  uint8_t tag_length = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);
#endif//PSA_WANT_ALG_CCM

  psa_algorithm_t alg = PSA_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG(operation->alg);

  switch (alg) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_GCM:
      status = sl_se_gcm_multipart_starts(&operation->ctx.gcm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          preinit.direction,
                                          preinit.nonce,
                                          preinit.nonce_length,
                                          input,
                                          input_length);
      if (status != SL_STATUS_OK) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }

      operation->ad_len += input_length;
      return PSA_SUCCESS;
#endif//PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM:
      status = sl_se_ccm_multipart_starts(&operation->ctx.ccm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          preinit.direction,
                                          preinit.pt_length,
                                          preinit.nonce,
                                          preinit.nonce_length,
                                          input,
                                          input_length,
                                          tag_length);

      if (status != SL_STATUS_OK) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }
      operation->ad_len += input_length;
      return PSA_SUCCESS;
#endif //PSA_WANT_ALG_CCM
    default:
      (void) input;
      (void) input_length;
      return PSA_ERROR_NOT_SUPPORTED;
  }
}
#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

psa_status_t sli_se_driver_aead_update_ad(sli_se_driver_aead_operation_t *operation,
                                          uint8_t *key_buffer,
                                          const uint8_t *input,
                                          size_t input_length)
{
#if defined(PSA_WANT_ALG_CCM) \
  || defined(PSA_WANT_ALG_GCM)

  if (operation == NULL
      || key_buffer == NULL
      || (input == NULL && input_length > 0)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  if (operation->ad_len > 0 || operation->pt_len > 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // Start operation
  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  return aead_start(operation, input, input_length);

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)operation;
  (void)key_buffer;
  (void)input;
  (void)input_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_se_driver_aead_update(sli_se_driver_aead_operation_t *operation,
                                       uint8_t *key_buffer,
                                       const uint8_t *input,
                                       size_t input_length,
                                       uint8_t *output,
                                       size_t output_size,
                                       size_t *output_length)
{
#if defined(PSA_WANT_ALG_CCM) \
  || defined(PSA_WANT_ALG_GCM)

  (void)key_buffer;
  sl_status_t status;

  sl_se_command_context_t cmd_ctx = { 0 };

  status = sl_se_init_command_context(&cmd_ctx);
  if (status != SL_STATUS_OK) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  if (output_size < input_length) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  if (operation == NULL
      || ((input == NULL || output == NULL) && input_length > 0)
      || output_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

