espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_se_driver_aead.c
  // Start operation
  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  psa_algorithm_t alg = PSA_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG(operation->alg);

  psa_status_t psa_status;

  // Operation isn't initialised unless we have either AD or PT, so if we are
  // still at 0, we need to run the start step.
  if (operation->ad_len == 0 && operation->pt_len == 0) {
    psa_status = aead_start(operation, NULL, 0);
    if (psa_status != PSA_SUCCESS) {
      return psa_status;
    }
  }

  switch (alg) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_GCM:
    {
      status = sl_se_gcm_multipart_update(&operation->ctx.gcm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          input_length,
                                          input,
                                          output,
                                          output_length);
      if (status != SL_STATUS_OK) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }
      psa_status = PSA_SUCCESS;
      operation->pt_len += input_length;
      break;
    }
#endif // PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM:
    {
      status = sl_se_ccm_multipart_update(&operation->ctx.ccm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          input_length,
                                          input,
                                          output,
                                          output_length);
      if (status != SL_STATUS_OK) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }
      psa_status = PSA_SUCCESS;
      operation->pt_len += input_length;
      break;
    }
#endif //PSA_WANT_ALG_CCM
    default:
      psa_status = PSA_ERROR_NOT_SUPPORTED;
      break;
  }

  return psa_status;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)operation;
  (void)key_buffer;
  (void)input;
  (void)input_length;
  (void)output;
  (void)output_size;
  (void)output_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_se_driver_aead_finish(sli_se_driver_aead_operation_t *operation,
                                       uint8_t *key_buffer,
                                       uint8_t *ciphertext,
                                       size_t ciphertext_size,
                                       size_t *ciphertext_length,
                                       uint8_t *tag,
                                       size_t tag_size,
                                       size_t *tag_length)
{
#if (defined(PSA_WANT_ALG_CCM)) \
  || defined(PSA_WANT_ALG_GCM)

  (void)ciphertext;
  (void)ciphertext_size;
  (void)key_buffer;

  sl_status_t status;
  psa_status_t psa_status;

  sl_se_command_context_t cmd_ctx = { 0 };

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  uint32_t tag_len = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);

  if (tag_size < tag_len) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  if (ciphertext_length == NULL
      || tag == NULL
      || tag_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  *ciphertext_length = 0;

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // Operation isn't initialised unless we have either AD or PT, so  if we are
  // still at 0, we need to run the start step.
  if (operation->ad_len == 0 && operation->pt_len == 0) {
    psa_status = aead_start(operation, NULL, 0);
    if (psa_status != PSA_SUCCESS) {
      return psa_status;
    }
  }

  psa_algorithm_t alg = PSA_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG(operation->alg);

  status = sl_se_init_command_context(&cmd_ctx);
  if (status != SL_STATUS_OK) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  switch (alg) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_GCM:
      if (operation->ctx.gcm.mode != SL_SE_ENCRYPT) {
        psa_status = PSA_ERROR_INVALID_ARGUMENT;
        goto exit;
      }
      status = sl_se_gcm_multipart_finish(&operation->ctx.gcm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          tag,
                                          tag_len,
                                          ciphertext,
                                          ciphertext_size,
                                          (uint8_t *)ciphertext_length);
      if (status != SL_STATUS_OK) {
        psa_status = PSA_ERROR_HARDWARE_FAILURE;
        goto exit;
      }
      *tag_length = tag_len;
      psa_status = PSA_SUCCESS;
      break;
#endif // PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM:
      if (operation->ctx.ccm.mode != SL_SE_ENCRYPT) {
        psa_status = PSA_ERROR_INVALID_ARGUMENT;
        goto exit;
      }
      status = sl_se_ccm_multipart_finish(&operation->ctx.ccm,
                                          &cmd_ctx,
                                          &operation->key_desc,
                                          tag,
                                          tag_len,
                                          ciphertext,
                                          ciphertext_size,
                                          (uint8_t *)ciphertext_length);

      if (status != SL_STATUS_OK) {
        psa_status = PSA_ERROR_HARDWARE_FAILURE;
        goto exit;
      }
      *tag_length = operation->ctx.ccm.tag_len;
      psa_status = PSA_SUCCESS;
      break;

#endif // PSA_WANT_ALG_CCM
    default:
      (void)tag_size;
      psa_status = PSA_ERROR_NOT_SUPPORTED;
      goto exit;
  }

  exit:

  status = sl_se_deinit_command_context(&cmd_ctx);
  if (status != SL_STATUS_OK) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  return psa_status;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)operation;
  (void)key_buffer;
  (void)ciphertext;
  (void)ciphertext_size;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_size;
  (void)tag_length;

  return PSA_ERROR_NOT_SUPPORTED;

